emacs_studio/example.org
* ORG
** Install
sudo apt install org-mode
*** Export document
c-c c-e h : export to html and open in web browser.

* expand and collapse org mode tree
  <TAB>
  shift+<TAB> : expand and collapse all

* Add text

You can make *bold* or /italics/ or if _underline_, and = =code=, ~verbatim~

# this is a comment
**  COMMENT do not export tif you have this tag
will not go to html

* Lists

- an entry
  - sub list entryt
  - another entyr in a sublist
** Task list
- [ ] this is a todo item.
- [ ] change state of a todo with C-c C-c
- [X] finished task has an X

** TODO creating todo and donw items
shift-RightArrow or C-c C-t
*** TODO todo
*** DONE done

* Tagging entry C-c C-c				 :researchtools:teaching:org:
** 2nd tagged entry 				       :researchtools:raster:
** 3nd tagged entry 						     :raster:

* build a table
| colum 1    | column 2         |
|------------+------------------|
| hello      | name             |
| ----+<Tab> | create dash line |
|------------+------------------|
* Source code

#+BEGIN_SRC sh :exports both
echo "Hello world"   #C-c C-c
#+END_SRC

#+RESULTS:
: Hello world

#+BEGIN_SRC python :exports both
return "Hello world from python" #python comment
#+END_SRC

#+RESULTS:
: Hello world from python

* Latex Mode

#+BEGIN_SRC Latex
\begin{equation}
x=\sqrt{b}
\end{equation}	
#+END_SRC

* Data and time. No time zone support
C-c . : insert a timestamp
<2017-04-29 六>
Shift-up or shift-Down : change by + or -

c-u c-c . : insert timestamp with time
<2017-04-29 六 15:38>

* Links
- [[http:www.baidu.com][baidu]] : www.baidu.com  C-c C-l: edit the link

