emacs_studio/example.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-05-07 Sun 11:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yubao" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org388c42f">1. ORG</a>
<ul>
<li><a href="#orgdecbb18">1.1. Install</a>
<ul>
<li><a href="#org7c5b652">1.1.1. Export document</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgae35dac">2. expand and collapse org mode tree</a></li>
<li><a href="#org7785b99">3. Add text</a></li>
<li><a href="#orgff918af">4. Lists</a>
<ul>
<li><a href="#orgab9c580">4.1. Task list</a></li>
<li><a href="#org555185b">4.2. <span class="todo TODO">TODO</span> creating todo and donw items</a>
<ul>
<li><a href="#org2a7ea95">4.2.1. <span class="todo TODO">TODO</span> todo</a></li>
<li><a href="#org166b031">4.2.2. <span class="done DONE">DONE</span> done</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd4fba67">5. Tagging entry C-c C-c&#xa0;&#xa0;&#xa0;<span class="tag"><span class="researchtools">researchtools</span>&#xa0;<span class="teaching">teaching</span>&#xa0;<span class="org">org</span></span></a>
<ul>
<li><a href="#org7959b9c">5.1. 2nd tagged entry&#xa0;&#xa0;&#xa0;<span class="tag"><span class="researchtools">researchtools</span>&#xa0;<span class="raster">raster</span></span></a></li>
<li><a href="#org1d991f6">5.2. 3nd tagged entry&#xa0;&#xa0;&#xa0;<span class="tag"><span class="raster">raster</span></span></a></li>
</ul>
</li>
<li><a href="#org4770d11">6. build a table</a></li>
<li><a href="#org2ef55dc">7. Source code</a></li>
<li><a href="#org5931924">8. Latex Mode</a></li>
<li><a href="#org722cd6d">9. Data and time. No time zone support</a></li>
<li><a href="#org19d4430">10. Links</a></li>
</ul>
</div>
</div>
<div id="outline-container-org388c42f" class="outline-2">
<h2 id="org388c42f"><span class="section-number-2">1</span> ORG</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgdecbb18" class="outline-3">
<h3 id="orgdecbb18"><span class="section-number-3">1.1</span> Install</h3>
<div class="outline-text-3" id="text-1-1">
<p>
sudo apt install org-mode
</p>
</div>
<div id="outline-container-org7c5b652" class="outline-4">
<h4 id="org7c5b652"><span class="section-number-4">1.1.1</span> Export document</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
c-c c-e h : export to html and open in web browser.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgae35dac" class="outline-2">
<h2 id="orgae35dac"><span class="section-number-2">2</span> expand and collapse org mode tree</h2>
<div class="outline-text-2" id="text-2">
<p>
&lt;TAB&gt;
shift+&lt;TAB&gt; : expand and collapse all
</p>
</div>
</div>

<div id="outline-container-org7785b99" class="outline-2">
<h2 id="org7785b99"><span class="section-number-2">3</span> Add text</h2>
<div class="outline-text-2" id="text-3">
<p>
You can make <b>bold</b> or <i>italics</i> or if <span class="underline">underline</span>, and = <code>code</code>, <code>verbatim</code>
</p>
</div>
</div>
<div id="outline-container-orgff918af" class="outline-2">
<h2 id="orgff918af"><span class="section-number-2">4</span> Lists</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>an entry
<ul class="org-ul">
<li>sub list entryt</li>
<li>another entyr in a sublist</li>
</ul></li>
</ul>
</div>
<div id="outline-container-orgab9c580" class="outline-3">
<h3 id="orgab9c580"><span class="section-number-3">4.1</span> Task list</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> this is a todo item.</li>
<li class="off"><code>[&#xa0;]</code> change state of a todo with C-c C-c</li>
<li class="on"><code>[X]</code> finished task has an X</li>
</ul>
</div>
</div>

<div id="outline-container-org555185b" class="outline-3">
<h3 id="org555185b"><span class="section-number-3">4.2</span> <span class="todo TODO">TODO</span> creating todo and donw items</h3>
<div class="outline-text-3" id="text-4-2">
<p>
shift-RightArrow or C-c C-t
</p>
</div>
<div id="outline-container-org2a7ea95" class="outline-4">
<h4 id="org2a7ea95"><span class="section-number-4">4.2.1</span> <span class="todo TODO">TODO</span> todo</h4>
</div>
<div id="outline-container-org166b031" class="outline-4">
<h4 id="org166b031"><span class="section-number-4">4.2.2</span> <span class="done DONE">DONE</span> done</h4>
</div>
</div>
</div>

<div id="outline-container-orgd4fba67" class="outline-2">
<h2 id="orgd4fba67"><span class="section-number-2">5</span> Tagging entry C-c C-c&#xa0;&#xa0;&#xa0;<span class="tag"><span class="researchtools">researchtools</span>&#xa0;<span class="teaching">teaching</span>&#xa0;<span class="org">org</span></span></h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-org7959b9c" class="outline-3">
<h3 id="org7959b9c"><span class="section-number-3">5.1</span> 2nd tagged entry&#xa0;&#xa0;&#xa0;<span class="tag"><span class="researchtools">researchtools</span>&#xa0;<span class="raster">raster</span></span></h3>
</div>
<div id="outline-container-org1d991f6" class="outline-3">
<h3 id="org1d991f6"><span class="section-number-3">5.2</span> 3nd tagged entry&#xa0;&#xa0;&#xa0;<span class="tag"><span class="raster">raster</span></span></h3>
</div>
</div>

<div id="outline-container-org4770d11" class="outline-2">
<h2 id="org4770d11"><span class="section-number-2">6</span> build a table</h2>
<div class="outline-text-2" id="text-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">colum 1</th>
<th scope="col" class="org-left">column 2</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">hello</td>
<td class="org-left">name</td>
</tr>

<tr>
<td class="org-left">-&#x2014;+&lt;Tab&gt;</td>
<td class="org-left">create dash line</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org2ef55dc" class="outline-2">
<h2 id="org2ef55dc"><span class="section-number-2">7</span> Source code</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-sh">echo "Hello world"   #C-c C-c
</pre>
</div>

<pre class="example">
Hello world

</pre>

<div class="org-src-container">
<pre class="src src-python">return "Hello world from python" #python comment
</pre>
</div>

<pre class="example">
Hello world from python

</pre>
</div>
</div>

<div id="outline-container-org5931924" class="outline-2">
<h2 id="org5931924"><span class="section-number-2">8</span> Latex Mode</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-Latex">\begin{equation}
x=\sqrt{b}
\end{equation}	
</pre>
</div>
</div>
</div>

<div id="outline-container-org722cd6d" class="outline-2">
<h2 id="org722cd6d"><span class="section-number-2">9</span> Data and time. No time zone support</h2>
<div class="outline-text-2" id="text-9">
<p>
C-c . : insert a timestamp
<span class="timestamp-wrapper"><span class="timestamp">&lt;2017-04-29 Sat&gt;</span></span>
Shift-up or shift-Down : change by + or -
</p>

<p>
c-u c-c . : insert timestamp with time
<span class="timestamp-wrapper"><span class="timestamp">&lt;2017-04-29 Sat 15:38&gt;</span></span>
</p>
</div>
</div>

<div id="outline-container-org19d4430" class="outline-2">
<h2 id="org19d4430"><span class="section-number-2">10</span> Links</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li><a href="http:www.baidu.com">baidu</a> : www.baidu.com  C-c C-l: edit the link</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: yubao</p>
<p class="date">Created: 2017-05-07 Sun 11:17</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
